first_routes_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" WHERE "users"."id" = $1  [["id", "1"]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 4]]
---
    def index
        # debugger
        artworks_owned = Artwork.joins(:artist).where(users: {id: params[:user_id]})
        artworks_shared = Artwork.joins(:artwork_shares).where(artwork_shares: {viewer_id: params[:user_id]})

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        artworks = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.nightlynighttwo.com"], ["updated_at", "2021-03-31 21:13:29.417748"], ["id", 3]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]
---
    def destroy
        artworks = Artwork.find(params[:id])
        artworks.destroy