first_routes_controllers/app/controllers/comments_controller.rb

SELECT comments.* FROM "users" INNER JOIN "comments" ON "comments"."commenter_id" = "users"."id" WHERE "users"."id" = $1  [["id", 1]]
SELECT comments.* FROM "artworks" INNER JOIN "comments" ON "comments"."artwork_id" = "artworks"."id" WHERE "artwork"."id" = $1  [["id", "1"]]
SELECT comments.* FROM "users" INNER JOIN "artworks" ON "artworks"."artist_id" = "users"."id" INNER JOIN "comments" ON "comments"."artwork_id" = "artworks"."id" WHERE "artworks"."id" = $1 AND "comments"."commenter_id" = $2  [["id", nil], ["commenter_id", nil]]
---
    def index
        if params.has_key?(:commenter_id) && !params.has_key?(:artwork_id)
            render json: User.joins(:comments)
                             .where(users: {id: params[:commenter_id]})
                             .select('comments.*')
        elsif params.has_key?(:artwork_id) && !params.has_key?(:commenter_id)
            render json: Artwork.joins(:comments)
                                .where(artworks: {id: params[:artwork_id]})
                                .select('comments.*')
        elsif params.has_key?(:artwork_id) && params.has_key?(:commenter_id)
            if params[:artwork_id].empty? && params[:commenter_id].empty?
                render json: "Please specify user and/or artwork"
            else
                render json: User.joins(:artworks_comments)
                                .where(artworks: {id: params[:artwork_id]})
                                .where(comments: {commenter_id: params[:commenter_id]})
                                .select('comments.*')

INSERT INTO "comments" ("commenter_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter_id", 1], ["artwork_id", 1], ["body", "\"test comment\""], ["created_at", "2021-04-01 18:14:36.340822"], ["updated_at", "2021-04-01 18:14:36.340822"]]
---
    def create
        comment = Comment.new(comment_params)
        if comment.save