first_routes_controllers/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."likeable_type" = $1 AND "likes"."likeable_id" = $2  [["likeable_type", "Comment"], ["likeable_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_type" = $1 AND "likes"."likeable_id" = $2  [["likeable_type", "Artwork"], ["likeable_id", 1]]
---
    def index
        if params.has_key?(:comment_id)
            comment_likes = Like.where(likeable_type: :Comment).where(likeable_id: params[:comment_id])
            render json: comment_likes
        elsif params.has_key?(:artwork_id)
            artwork_likes = Like.where(likeable_type: :Artwork).where(likeable_id: params[:artwork_id])

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["likeable_type", "Comment"], ["likeable_id", 3], ["created_at", "2021-04-01 21:18:36.073799"], ["updated_at", "2021-04-01 21:18:36.073799"]]
---
    def create
        like = Like.new(like_params)
        if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 11]]
---
    def destroy
        like = Like.find(params[:id])
        like.destroy