first_routes_controllers/app/controllers/users_controller.rb

    def index

        unless params[:name]
            users = User.all
            render json: users
        else
            user = User.find_by(username: params[:name])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "aracho"], ["LIMIT", 1]]

    def create

        user = User.new(params.require(:user).permit(:username))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "daniel"], ["email", "daniel@gmail.com"], ["created_at", "2021-03-31 18:46:37.314497"], ["updated_at", "2021-03-31 18:46:37.314497"]]

    def show
        users = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        users = User.find(params[:id])
        users.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]